{
  "backend/main.mo": "Main Motoko actor defining Flight, Reservation, CabinCrewApplication, and AtcApplication types with CRUD operations for flights, reservations, applications, and flight status management, including admin authentication with hardcoded password.",
  "backend/migration.mo": "Migration module defining type schemas for Flight, Reservation, CabinCrewApplication, AtcApplication, and FlightStatus, with a run function that migrates OldActor state to NewActor by adding currentFlightStatus field.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: hero section redesign, flight status indicator on main page, admin flight status editor, and React Query integration for auto-refreshing status.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 16 frontend files describing the complete React application structure including routing, components, pages, styling, and hooks for the Air Canada Virtual flight booking system.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, borders, and component colors using CSS custom properties.",
  "frontend/index.html": "HTML entry point with root div and module script tag loading main.tsx, titled 'Air Canada Virtual'.",
  "frontend/src/App.tsx": "TanStack Router configuration defining six routes (index, departures, careers, apply, admin-ops, admin-ops/dashboard) wrapped in shared Layout component with Outlet for nested routing.",
  "frontend/src/components/BookingModal.tsx": "Dialog modal component for flight reservations with form inputs for passenger name, Discord username, and Roblox username, displaying a styled boarding pass confirmation after successful submission via backend mutation.",
  "frontend/src/components/FlightManagementForm.tsx": "Form component for adding new flights with fields for flight number, origin, destination, aircraft type, and departure/arrival times. Uses React Query mutation to submit flight data to the backend actor and displays success/error toasts.",
  "frontend/src/components/FlightStatusEditor.tsx": "Admin component for managing flight operational status with a dropdown selector for predefined statuses (On Time, Delayed, Cancelled, etc.). Uses custom hooks to fetch current status and mutate it with optimistic UI updates.",
  "frontend/src/components/FlightStatusIndicator.tsx": "Display component that shows the current flight operational status with color-coded icons (green for on-time, yellow for delayed, red for cancelled). Handles loading and error states with skeleton UI.",
  "frontend/src/components/FlightStatusTicker.tsx": "Animated ticker component that cycles through hardcoded flight status updates every 4 seconds with a sliding transition effect. Displays gate assignments, boarding status, and load factors.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with sticky header, navigation links, hero section with background image, and footer. Includes FlightStatusTicker and FlightStatusIndicator components, plus a hidden admin login button.",
  "frontend/src/hooks/useActor.ts": "Custom React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation. Provides login/logout functions and status flags for authentication flow.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for flight status operations: useGetFlightStatus fetches current status with 30-second polling, and useSetFlightStatus provides a mutation for updating status with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, Air Canada red branding colors, and glassmorphism utility classes for backdrop blur effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin operations dashboard page displaying FlightManagementForm and FlightStatusEditor components with logout functionality and branded header.",
  "frontend/src/pages/AdminLogin.tsx": "Staff authentication page with password input that calls actor.authenticate() and navigates to admin dashboard on success.",
  "frontend/src/pages/ApplicationForm.tsx": "Dynamic job application form supporting cabin crew and ATC roles with role-specific fields, submitting via actor mutations and showing success confirmation.",
  "frontend/src/pages/Careers.tsx": "Careers landing page displaying three role cards (Flight Deck, Cabin Crew, ATC) with apply buttons that either open external Google Forms or navigate to internal application form.",
  "frontend/src/pages/Departures.tsx": "Flight departures listing page that fetches all flights via actor, displays them in cards with route/time/aircraft details, and opens BookingModal for selected flights.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom colors using OKLCH color space, Air Canada red branding, glassmorphism shadows, and accordion animations.",
  "project_state.json": "Project state file tracking an Air Canada Virtual airline simulation web app with glassmorphism design, flight booking, careers page with Google Form integration, and password-protected admin dashboard. Documents architectural notes, existing features (glassmorphism design, departures/booking system, careers page, admin panel with flight management), and tracks requirement IDs and feature versions."
}